app/controllers/books_controller.rb

INSERT INTO "books" ("name", "author", "year_released", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "er3r"], ["author", "rwe"], ["year_released", 0], ["created_at", "2018-03-17 18:12:06.613475"], ["updated_at", "2018-03-17 18:12:06.613475"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "year_released" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["year_released", 1931], ["updated_at", "2018-03-16 18:14:47.096305"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)