app/controllers/movies_controller.rb

  def create

    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("name", "director", "year_released", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "rewe"], ["director", "rweer"], ["year_released", 123], ["created_at", "2018-03-17 18:08:17.836474"], ["updated_at", "2018-03-17 18:08:17.836474"]]

  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "year_released" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["year_released", 11953], ["updated_at", "2018-03-16 18:22:42.103476"], ["id", 1]]